## Introduction to NumPy and Pandas 

We will start with NumPy. 

NumPy (Numerical Python) is an open-source Python library. It’s the universal standard for working with numerical data in Python. NumPy is used extensively in Pandas, SciPy, Matplotlib, scikit-learn, scikit-image and most other data science and scientific Python packages.

The NumPy library contains multidimensional array and matrix data structures. It provides ndarray, a homogeneous n-dimensional array object, with methods to **efficiently operate** on it. NumPy can be used to perform a wide variety of mathematical operations on arrays. It adds powerful data structures to Python that guarantee efficient calculations with arrays and matrices and it supplies an enormous library of high-level mathematical functions that operate on these arrays and matrices.

The above packages, and more, use NumPy arrays. Even though these packages typically support other inputs (lists, dictionarys, rows and/or columns in a dataframe...), they convert such input to NumPy arrays prior to processing, and they often output NumPy arrays.

Thus, in order to efficiently use the packages we will be using throughout the course, a fundamental understanding of NumPy arrays is important.

Helpful tutorials:

https://numpy.org/learn/

https://towardsdatascience.com/the-ultimate-beginners-guide-to-numpy-f5a2f99aef54

In [1]:
# importing the library

import numpy as np

### Creating an array

**What is an array?**

An array is a homogeneous, fixed-size collection of items.
* Homogeneous, so all items are of the same data type
* Fixed-size meaning once intialized with a certain numbers of rows/columns, it cannot be changed. The workaround is that a new array is created to hold the changed old array.

A helpful guide to visualizing arrays: https://betterprogramming.pub/numpy-illustrated-the-visual-guide-to-numpy-3b1d4976de1d

In [2]:
# Creating our first array

a = np.array([1,2,3], dtype="int32")
print(a)

print("This array has", a.ndim, "dimension")
# A vector: 1D array


print("This array is of size", a.size) # Number of elements

[1 2 3]
This array has 1 dimension
This array is of size 3

In [3]:
b = np.array([[9.0,8.0,7.0],[1.0,2.0,3.0]])
print(b)

print("This array has", b.ndim, "dimensions")
# A matrix: 2D array

print("This array has shape of", b.shape)
print("This array is of size", b.size) # Number of elements

[[9. 8. 7.]
 [1. 2. 3.]]
This array has 2 dimensions
This array has shape of (2, 3)
This array is of size 6

NumPy’s array class is called ndarray. 

ndarray.ndim will tell you the number of axes, or dimensions, of the array.

ndarray.size will tell you the total number of elements of the array. This is the product of the elements of the array’s shape.

ndarray.shape will display a tuple of integers that indicate the number of elements stored along each dimension of the array.

Note that the NumPy array tries to conform all elements to the same data type.

You can specify the data type of the array elements using the dtype parameter (play around with the **a** ndarray).

In [4]:
#Conforming all elements to float; note that the default is float.

c = np.array([[9,8,7.0],[1.0,2.0,3.0]])

print(c)

# Try bypassing that by using the dtype parameter.

[[9. 8. 7.]
 [1. 2. 3.]]

In [5]:
a = np.array([[1,2,3,4,5,6,7],[8,9,10,11,12,13,14]])

print(a)
print(a.shape)

[[ 1  2  3  4  5  6  7]
 [ 8  9 10 11 12 13 14]]
(2, 7)

In [6]:
# Getting a specific element [r,c]
# Remember indexing starts at 0

a[0,5] #First row, sixth column

6

In [7]:
# Get a specific row 
a[0, :]

array([1, 2, 3, 4, 5, 6, 7])

In [8]:
# Get a specific column
a[:, 2]

array([ 3, 10])

In [9]:
# Remember indexing parameters [startindex:endindex:stepsize]
a[0, 1:-1:2] #first row, column parameters

array([2, 4, 6])

In [10]:
# Changing arrays' element 

a[0,5] = 10

a[0,5]

10

In [11]:
# You can also build n-dimension arrays

b = np.array([[[1,2],[3,4]],[[5,6],[7,8]]])
print(b) 

# An array that has 2-D arrays (matrices) as its elements is called 3-D array.

[[[1 2]
  [3 4]]

 [[5 6]
  [7 8]]]

In [12]:
# Get specific element (works outside in with 3D arrays)
b[0,1,1] #The first set, second row, second column

4

### Initializing Different Types of Arrays

In [13]:
# All 0s matrix
np.zeros((2,3))

array([[0., 0., 0.],
       [0., 0., 0.]])

In [14]:
# All 1s matrix
np.ones((2,3), dtype ='int32')

array([[1, 1, 1],
       [1, 1, 1]])

In [15]:
# Any other number
np.full((2,2), 100)

array([[100, 100],
       [100, 100]])

In [16]:
# Random decimal numbers
np.random.rand(4,2)

array([[0.65244292, 0.43735353],
       [0.71169839, 0.83634847],
       [0.55324579, 0.57815706],
       [0.03140338, 0.51104864]])

In [17]:
# Random Integer values
np.random.randint(-4,8, size=(3,3)) #range of values from -4 to 8

array([[ 7,  1,  5],
       [-3,  5, -1],
       [ 2,  0, -3]])

In [18]:
# Identity matrix
np.identity(5) # 5 x 5 matrix

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

### Array functions 
To learn more about the most common array functions, go to the following link: 
https://numpy.org/doc/stable/reference/routines.html and https://numpy.org/doc/stable/user/index.html

With arrays, you can add elements & delete elements (note that it basically creates a new array), transpose array, split array, joining/merging arrays, and you can also reshape the array. And more. Note that reshaping the array can only be done if both shapes/format of the array have the same number of elements. Remember that the number of elements is calculated as row * columns.

### An example of some functions

In [19]:
before = np.array([[1,2,3,4],[5,6,7,8]])
print(before)

after = before.reshape((4,2))
print(after)

[[1 2 3 4]
 [5 6 7 8]]
[[1 2]
 [3 4]
 [5 6]
 [7 8]]

In [20]:
# Vertical Stack
v1 = np.array([1,2,3,4])
v2 = np.array([5,6,7,8])

np.vstack([v1,v2,v1,v2])

array([[1, 2, 3, 4],
       [5, 6, 7, 8],
       [1, 2, 3, 4],
       [5, 6, 7, 8]])

In [21]:
# Horizontal Stack
h1 = np.ones((2,4))
h2 = np.zeros((2,2))

np.hstack((h1,h2))

array([[1., 1., 1., 1., 0., 0.],
       [1., 1., 1., 1., 0., 0.]])

In [22]:
# For more on sorting: https://numpy.org/doc/stable/reference/routines.sort.html 
a = np.array([[19, 1], [15, 94]])
print ("The input array is : \n", a)

# sorting without a defined axis parameter, sorts elements withing each row, using the column axis
a_sorted =  np.sort(a)
print("A sorted array is : \n", a_sorted)

#sorting along the last axis, same as above
a_sorted = np.sort(a, axis = -1)
print ("Sorted array along the last axis : \n", a_sorted)

# sorting along the first axis/the row
a_sorted = np.sort(a, axis = 0)
print ("Sorted array along the first axis : \n", a_sorted)


#sorting the flattened axis
a_sorted = np.sort(a, axis = None)
print ("Sorted array when flattened: \n", a_sorted)

# More on sorting can be found here: https://www.educba.com/numpy-sort/?source=leftnav

The input array is :
 [[19  1]
 [15 94]]
A sorted array is :
 [[ 1 19]
 [15 94]]
Sorted array along the last axis :
 [[ 1 19]
 [15 94]]
Sorted array along the first axis :
 [[15  1]
 [19 94]]
Sorted array when flattened:
 [ 1 15 19 94]

### Mathematics

For more visit: https://docs.scipy.org/doc/numpy/reference/routines.math.html

In [23]:
a = np.array([1,2,3,4])
print(a)

[1 2 3 4]

In [24]:
a + 2

array([3, 4, 5, 6])

In [25]:
a - 2

array([-1,  0,  1,  2])

In [26]:
a * 2

array([2, 4, 6, 8])

In [27]:
a / 2

array([0.5, 1. , 1.5, 2. ])

In [28]:
a ** 2

array([ 1,  4,  9, 16], dtype=int32)

In [29]:
a = np.array([1,2,3,4])
b = np.array([1,0,1,0])

a + b

array([2, 2, 4, 4])

In [30]:
np.cos(a)

array([ 0.54030231, -0.41614684, -0.9899925 , -0.65364362])

### Linear Algebra
For more visit: https://docs.scipy.org/doc/numpy/reference/routines.linalg.html

In [31]:
# Matrix product of 2 arrays

a = np.ones((2,3))
print(a)

b = np.full((3,2), 2)
print(b)

np.matmul(a,b)

# Note that with 2D arrays, np.dot() does the same things, but the np.matmul is better
# https://numpy.org/doc/stable/reference/generated/numpy.dot.html

[[1. 1. 1.]
 [1. 1. 1.]]
[[2 2]
 [2 2]
 [2 2]]

array([[6., 6.],
       [6., 6.]])

In [32]:
# Find the determinant
# Note that in mathematics, the determinant is a scalar value that is a function of the entries of a square matrix. 
c = np.identity(3)
np.linalg.det(c)

1.0

### Statisics

In [33]:
a = np.array([[1,2,3],[4,6,5]])
print(a)
np.min(a)

[[1 2 3]
 [4 6 5]]

1

In [34]:
np.max(a, axis = 1) # Of each row

array([3, 6])

In [35]:
np.max(a, axis = 0) # Of each column

array([4, 6, 5])

In [36]:
np.sum(a, axis = 1) # Of each row's elements

array([ 6, 15])

In [37]:
np.sum(a, axis = 0) # Of each column's elements

array([5, 8, 8])

### Loading Data from file

In [38]:
filedata = np.genfromtxt('/Users/noura/Desktop/Work/FEPS/2022-2023/P420 Data Science in PoliSci/TA Sessions/data.txt', delimiter=',')
filedata = filedata.astype('int32')
print(filedata)

[[  1  13  21  11 196  75   4   3  34   6   7   8   0   1   2   3   4   5]
 [  3  42  12  33 766  75   4  55   6   4   3   4   5   6   7   0  11  12]
 [  1  22  33  11 999  11   2   1  78   0   1   2   9   8   7   1  76  88]]

## pandas 

pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool.

It offers:
* A fast and efficient DataFrame object for data manipulation 
* Tools for reading and writing data 
* Intelligent data alignment and integrated handling of missing data
* Flexible reshaping and pivoting of datasets
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets
* Time series-functionality: date range generation and frequency conversion, moving window statistics, date shifting and lagging. Even create domain-specific time offsets and join time series without losing data;

Documentation: 

https://pandas.pydata.org/docs/user_guide/index.html

Helpful tutorials:

https://pandas.pydata.org/docs/getting_started/tutorials.html

https://pandas.pydata.org/docs/getting_started/tutorials.html

### pandas data structures

To summarize, there are two main pandas data structures: Series and DataFrame.

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.).

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. 

In this tutorial, we will focus on using pandas DataFrame with real world data. You can build your own DataFrame; however, we don’t usually create our own dataframes. 

Instead, we read explore, manipulate and visualise data in Pandas by importing data to a DataFrame.Pandas can read from multiple formats, but the usual one is Comma Separated Values, csv. 

For a more thorough introduction the pandas' data structures, view:
https://pandas.pydata.org/docs/user_guide/dsintro.html

### Data for pandas example 

One of the most famous datasets that people use to get into Machine Learning is the Titanic dataset. 

Link to data: https://www.kaggle.com/c/titanic/data?select=train.csv 

The main objective of this dataset is to study what are the factors that affect the survivability of a person onboard the titanic.

In [39]:
import pandas as pd

In [40]:
df = pd.read_csv('/Users/noura/Desktop/Work/FEPS/2022-2023/P420 Data Science in PoliSci/TA Sessions/train.csv')

# Replace the file path with your own
# This function transforms csv data into a pandas DataFrame

df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [41]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [43]:
# Summary of the dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Breakdown of the variables: 

survived:    Survival 

PassengerId: Unique Id of a passenger. 

pclass:    Ticket class     

sex:    Sex     

Age:    Age in years   

sibsp:    # of siblings / spouses aboard the Titanic 

parch:    # of parents / children aboard the Titanic

ticket:    Ticket number   

fare:    Passenger fare  

cabin:    Cabin number     

embarked:    Port of Embarkation

#### Get the unique values for each column

This could be especially helpful in quickly determining how clean some categorical variables are/pinpointing categorical variables. 

It could also be helpful in pinpointing how clean variables, where each value has to be unique, are.

In [44]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

#### Inspecting/Selecting certain columns

In [45]:
# You can inspect a certain column on its own

df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [46]:
# Or multiple columns 

df[['Pclass', 'Parch', 'Sex']]

     Pclass  Parch     Sex
0         3      0    male
1         1      0  female
2         3      0  female
3         1      0  female
4         3      0    male
..      ...    ...     ...
886       2      0    male
887       1      0  female
888       3      2  female
889       1      0    male
890       3      0    male

[891 rows x 3 columns]

#### Including/Excluding Certain columns

For example, in this dataset, the name, ticket, and passenger_id of a passenger play no role in whether the passenger survived or not.

To exclude these columns:

In [47]:
df1 = df[['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]
df1

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0           0       3    male  22.0      1      0   7.2500   NaN        S
1           1       1  female  38.0      1      0  71.2833   C85        C
2           1       3  female  26.0      0      0   7.9250   NaN        S
3           1       1  female  35.0      1      0  53.1000  C123        S
4           0       3    male  35.0      0      0   8.0500   NaN        S
..        ...     ...     ...   ...    ...    ...      ...   ...      ...
886         0       2    male  27.0      0      0  13.0000   NaN        S
887         1       1  female  19.0      0      0  30.0000   B42        S
888         0       3  female   NaN      1      2  23.4500   NaN        S
889         1       1    male  26.0      0      0  30.0000  C148        C
890         0       3    male  32.0      0      0   7.7500   NaN        Q

[891 rows x 9 columns]

In [48]:
df.drop(['Name', 'Ticket'], axis = 1, inplace=True)
df
# axis parameter determins rows or columns, inplace parameter tells Python to do what is request to the original variable

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,30.0000,B42,S
888,889,0,3,female,NaN,1,2,23.4500,NaN,S
889,890,1,1,male,26.0,0,0,30.0000,C148,C
890,891,0,3,male,32.0,0,0,7.7500,NaN,Q

#### Inspecting/Selecting certain rows

In [49]:
df.iloc[500:511]

# Remember ranges are exclusive

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
500,501,0,3,male,17.0,0,0,8.6625,NaN,S
501,502,0,3,female,21.0,0,0,7.7500,NaN,Q
502,503,0,3,female,NaN,0,0,7.6292,NaN,Q
503,504,0,3,female,37.0,0,0,9.5875,NaN,S
504,505,1,1,female,16.0,0,0,86.5000,B79,S
505,506,0,1,male,18.0,1,0,108.9000,C65,C
506,507,1,2,female,33.0,0,2,26.0000,NaN,S
507,508,1,1,male,NaN,0,0,26.5500,NaN,S
508,509,0,3,male,28.0,0,0,22.5250,NaN,S
509,510,1,3,male,26.0,0,0,56.4958,NaN,S
510,511,1,3,male,29.0,0,0,7.7500,NaN,Q

#### Conditional Selection 

Allows us to filter through the data, for example only data of male passengers or female passengers.

In [50]:
df[df['Sex'] == 'male']

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S
5,6,0,3,male,NaN,0,0,8.4583,NaN,Q
6,7,0,1,male,54.0,0,0,51.8625,E46,S
7,8,0,3,male,2.0,3,1,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,male,28.0,0,0,10.5000,NaN,S
884,885,0,3,male,25.0,0,0,7.0500,NaN,S
886,887,0,2,male,27.0,0,0,13.0000,NaN,S
889,890,1,1,male,26.0,0,0,30.0000,C148,C
890,891,0,3,male,32.0,0,0,7.7500,NaN,Q

How it works:

The command df[‘Sex’] == ‘male’ will return a Boolean for each row. Nesting a df[] over it will return the whole dataset for male passengers.

We can combine what we have learned thus far:

In [51]:
# Inspecting columns Pclass and sex, for those with value male for variable sex > for the 10 rows from 500-511 of the male passengers
df[['Pclass','Sex']][df['Sex'] == 'male'].iloc[500:511]

     Pclass   Sex
773       3  male
775       3  male
776       3  male
778       3  male
782       1  male
783       3  male
784       3  male
785       3  male
787       3  male
788       3  male
789       1  male

#### Aggregation Functions/Statistics

Note that only numerical columns will be included in these mathematical functions. Other columns will be automatically excluded.

In [52]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [53]:
df.max()

C:\Users\noura\AppData\Local\Temp\ipykernel_14228\1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

PassengerId         891
Survived              1
Pclass                3
Sex                male
Age                80.0
SibSp                 8
Parch                 6
Fare           512.3292
dtype: object

In [54]:
df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].max()

Survived      1.0000
Pclass        3.0000
Age          80.0000
SibSp         8.0000
Parch         6.0000
Fare        512.3292
dtype: float64

In [55]:
df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].min()

Survived    0.00
Pclass      1.00
Age         0.42
SibSp       0.00
Parch       0.00
Fare        0.00
dtype: float64

In [56]:
df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].median()

Survived     0.0000
Pclass       3.0000
Age         28.0000
SibSp        0.0000
Parch        0.0000
Fare        14.4542
dtype: float64

In [57]:
df.count() #How many non-NA values in each column

PassengerId    891
Survived       891
Pclass         891
Sex            891
Age            714
SibSp          891
Parch          891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [58]:
df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].std()

Survived     0.486592
Pclass       0.836071
Age         14.526497
SibSp        1.102743
Parch        0.806057
Fare        49.693429
dtype: float64

In [59]:
#Get the mean of the relevant variables for the rows 500-511

df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].iloc[500:511].mean()

Survived     0.454545
Pclass       2.363636
Age         25.000000
SibSp        0.090909
Parch        0.181818
Fare        33.486364
dtype: float64

In [60]:
# Correlation matrix 

df.corr()

# Interpret the survived column/row

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

We can also check the distribution of each column in a table format.

In [61]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

### Data cleaning

We have done enough exploration to understand our data, now before moving on to any type of analysis (i.e., regression, applying a ML algorithm, visualization of any type...etc.), we must clean our data. 

Cleaning data is challenging, needs a lot of practice, and is a very vital step.

Typically, we need to deal with null values, empty values, incorrect timestamps, wrong categorization/non-unified spelling and much more. What you do in each case is based on your data and interest.

#### Determining and dealing with NA values

The df.info() command has already told us there are null values. Let's explore this further

In [62]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [63]:
df[df['Age'].isnull()]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
5,6,0,3,male,NaN,0,0,8.4583,NaN,Q
17,18,1,2,male,NaN,0,0,13.0000,NaN,S
19,20,1,3,female,NaN,0,0,7.2250,NaN,C
26,27,0,3,male,NaN,0,0,7.2250,NaN,C
28,29,1,3,female,NaN,0,0,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,male,NaN,0,0,7.2292,NaN,C
863,864,0,3,female,NaN,8,2,69.5500,NaN,S
868,869,0,3,male,NaN,0,0,9.5000,NaN,S
878,879,0,3,male,NaN,0,0,7.8958,NaN,S
888,889,0,3,female,NaN,1,2,23.4500,NaN,S

You can drop the NA values, or you can choose a way to fill these NA values. For more on missing data or NA data,visit https://pandas.pydata.org/docs/user_guide/missing_data.html 

For the Age variable, we will take the mean of all ages and replace NA with it. This is a good way to handle null values as it doesn’t mess with the skewness of the values. Note on outliers with ML/computational methods (telling signs not to be removed).

We will drop the cabin column as it is a very significant % of missing values, may be better to retain our observations, but drop this value.

We will drop rows with missing embarked values.

In [64]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [65]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [66]:
df.drop(['Cabin'], axis = 1, inplace=True)

In [67]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [68]:
df.dropna(inplace=True)

In [69]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Sex          889 non-null    object
 4   Age          889 non-null    float64
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Fare         889 non-null    float64
 8   Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 69.5+ KB

#### Fixing Data Type

In [71]:
df['PassengerId'] = df['PassengerId'].astype(str)
df['Pclass'] = df['Pclass'].astype(str)  #Note this for later!
df['Age'] = df['Age'].astype(int)

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    object
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    object
 3   Sex          889 non-null    object
 4   Age          889 non-null    int32
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Fare         889 non-null    float64
 8   Embarked     889 non-null    object
dtypes: float64(1), int32(1), int64(3), object(4)
memory usage: 66.0+ KB

### GroupBy
Allows us to explore the data through groups.

In [73]:
df.groupby('Pclass').mean()

        Survived        Age     SibSp     Parch       Fare
Pclass
1       0.626168  36.822430  0.420561  0.359813  84.193516
2       0.472826  29.804348  0.402174  0.380435  20.662183
3       0.242363  26.191446  0.615071  0.393075  13.675550

In [74]:
df.groupby(['Pclass','Sex']).mean()

               Survived        Age     SibSp     Parch        Fare
Pclass Sex
1      female  0.967391  33.728261  0.565217  0.467391  106.693750
       male    0.368852  39.155738  0.311475  0.278689   67.226127
2      female  0.921053  28.723684  0.486842  0.605263   21.970121
       male    0.157407  30.564815  0.342593  0.222222   19.741782
3      female  0.500000  23.847222  0.895833  0.798611   16.118810
       male    0.135447  27.164265  0.498559  0.224784   12.661633

In [75]:
df.groupby(['Pclass','Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.967391
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

### Concatenation and Merging
Concatenation is to stitch data together along an axis, either the row or column axis.

To concatenate along the row axis: use pd.concat() and pass it a list of DataFrames that you want to concatenate.

For more information on merging and concatenation: https://realpython.com/pandas-merge-join-and-concat.

merge() and .join() allow you to combine Data on Common Columns or Indices. Options include inner, outer, left, or right.

Inner join: rows that do not match in the other DataFrame's key column will be lost.

Outer/full outer join: all rows from both DataFrames will be present in the new DataFrame.

Left outer join: all rows from the left DataFrame will be retained, while discarding rows from the right DataFrame that don’t have a match in the key column of the left DataFrame.

Right outer join: all rows from the right DataFrame will be retained, while rows in the left DataFrame without a match in the key column of the right DataFrame will be discarded.

In [76]:
first5 = df.head()
last5 = df.tail()
combined = pd.concat([first5,last5], axis = 0)

In [77]:
combined

    PassengerId  Survived Pclass     Sex  Age  SibSp  Parch     Fare Embarked
0             1         0      3    male   22      1      0   7.2500        S
1             2         1      1  female   38      1      0  71.2833        C
2             3         1      3  female   26      0      0   7.9250        S
3             4         1      1  female   35      1      0  53.1000        S
4             5         0      3    male   35      0      0   8.0500        S
886         887         0      2    male   27      0      0  13.0000        S
887         888         1      1  female   19      0      0  30.0000        S
888         889         0      3  female   29      1      2  23.4500        S
889         890         1      1    male   26      0      0  30.0000        C
890         891         0      3    male   32      0      0   7.7500        Q

When using concatenation, the columns have to match between dataframes.

To add columns, use merge() or .join() and specify the relevant parameters according to desired outcome.

### Data Manipulation

* Using functions
* Creating custom columns

#### Apply Function 

One of the strong features of pandas is the ability to apply functions. 

https://www.geeksforgeeks.org/python-pandas-apply/
https://www.geeksforgeeks.org/apply-function-to-every-row-in-a-pandas-dataframe/ 

We did the same with lists by iterating using a loop.

In [78]:
def pclass_name(x):
    if x == '1':
        x = '1st Class'
    if x == '2':
        x = '2nd Class'
    if x == '3':
        x = '3rd Class'
    return x

In [79]:
df['Pclass'] = df['Pclass'].apply(lambda x: pclass_name(x))

In [80]:
df['Pclass']

0      3rd Class
1      1st Class
2      3rd Class
3      1st Class
4      3rd Class
         ...
886    2nd Class
887    1st Class
888    3rd Class
889    1st Class
890    3rd Class
Name: Pclass, Length: 889, dtype: object

#### Creating Custom Columns

The following will be just synthetic data for demonstration.

In [81]:
import random
height = [] 
weight = [] 

for i in range(0,889):
    n = random.randint(140,200)
    height.append(n)
    
for i in range(0,889):
    n = random.randint(50,130)
    weight.append(n)

In [82]:
df['height'] = height
df['weight'] = weight

In [83]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,height,weight
0,1,0,3rd Class,male,22,1,0,7.2500,S,176,126
1,2,1,1st Class,female,38,1,0,71.2833,C,157,97
2,3,1,3rd Class,female,26,0,0,7.9250,S,157,97
3,4,1,1st Class,female,35,1,0,53.1000,S,185,78
4,5,0,3rd Class,male,35,0,0,8.0500,S,153,77

Let's imagine we are trying to create a column that calculates BMI for each passenger.

BMI = weight(kg) / height²(m) 

Action steps: 
1. Convert Height from cm to m and square it.
2. Calculate the BMI for each passenger in a new column 'BMI'

In [84]:
def convert_to_bmi(x):
    x = (x/100)**2
    return x

df['height2'] = df['height'].apply(lambda x: convert_to_bmi(x))

In [85]:
df['BMI'] = df['weight']/df['height2']

In [86]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,height,weight,height2,BMI
0,1,0,3rd Class,male,22,1,0,7.2500,S,176,126,3.0976,40.676653
1,2,1,1st Class,female,38,1,0,71.2833,C,157,97,2.4649,39.352509
2,3,1,3rd Class,female,26,0,0,7.9250,S,157,97,2.4649,39.352509
3,4,1,1st Class,female,35,1,0,53.1000,S,185,78,3.4225,22.790358
4,5,0,3rd Class,male,35,0,0,8.0500,S,153,77,2.3409,32.893332

### Exporting Data/Saving

In [87]:
df.to_csv('/Users/noura/Desktop/Work/FEPS/2022-2023/P420 Data Science in PoliSci/TA Sessions/final.csv')
#Use your own file path!